app/controllers/users_controller.rb

INSERT INTO `users` (`user_type`, `name`, `phone`, `deleted_at`, `created_at`, `updated_at`) VALUES (1, 'test', '22332332', NULL, '2023-04-23 06:55:53.965622', '2023-04-23 06:55:53.965622')
---
  def login
    if @user.present?
      if @user.user_type != params[:type].to_i
        return render json: { error: "请以第一次选定的用户类型进入" }, status: :unprocessable_entity
      end

      respond_to do |format|
        format.html { redirect_to meeting_users_path }
      end
    else
      @user = User.new({user_type: params[:type], name: params[:name], phone: params[:phone]})
      respond_to do |format|
        if @user.save

SELECT `meetings`.* FROM `meetings` WHERE `meetings`.`deleted_at` IS NULL
---
  def meeting
    @meetings = Meeting.all

SELECT `users`.* FROM `users` WHERE `users`.`deleted_at` IS NULL AND `users`.`name` = 'test' AND `users`.`phone` = '22332332' LIMIT 1
---
  def set_user
    @user = User.find_by(name: params[:name], phone: params[:phone])